Revit 2027 API
ParameterTypeId.RasterHorizontalScale Property
 "Horizontal Scale"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RasterHorizontalScale { get; }
Public Shared ReadOnly Property RasterHorizontalScale As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RasterHorizontalScale {
	ForgeTypeId^ get ();
}
static member RasterHorizontalScale : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace